benchmarks/conc10.txt
Max Request Concurrency 10


Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
100%|█████████████████████████████████████████████████████████████████████| 3000/3000 [09:01<00:00,  5.54it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3000      
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  541.75    
Total input tokens:                      663559    
Total generated tokens:                  572366    
Request throughput (req/s):              5.54      
Output token throughput (tok/s):         1056.51   
Peak output token throughput (tok/s):    1150.00   
Peak concurrent requests:                26.00     
Total token throughput (tok/s):          2281.35   
---------------Time to First Token----------------
Mean TTFT (ms):                          36.15     
Median TTFT (ms):                        29.99     
P99 TTFT (ms):                           75.66     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.32      
Median TPOT (ms):                        9.20      
P99 TPOT (ms):                           12.02     
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.28      
Median ITL (ms):                         8.92      
P99 ITL (ms):                            23.79     
==================================================